{
    "sections": {
        "about": {
            "header": "About",
            "blurb": "Driven, curious Software Engineer with a passion for web development and Machine Learning. Currently a developer at Shopify.",
            "content": [
                {
                    "header": "Constant Learner",
                    "body": [
                        "Continuously reading about Javascript/Ruby frameworks and advances in Natural Language Processing.",
                        "During my free time, I have been also self-teaching myself Japanese & mobile development."
                    ]
                },
                {
                    "header": "Musician",
                    "body": [
                        "Self-taught guitar player and singer who occasionally records music."
                    ]
                },
                {
                    "header": "Graduate",
                    "body": [
                        "Software Engineering, McGill University (Graduated in December 2020)",
                        "cGPA: 3.63 / 4.0",
                        "Health Sciences, College Jean-de-Brebeuf (Graduated in May 2015)"
                    ]
                }
            ]
        },
        "experience": {
            "header": "Experience",
            "content": [
                {
                    "header": {
                        "title": "Shopify Inc.",
                        "position": "Software Developer Intern",
                        "date": "May 2019 - August 2019"
                    },
                    "body": [
                        {
                            "header": "Learnings",
                            "body": "Developed my skills with Ruby and its framework Rails. I've also had the opportunity to learn various finance and accounting-related concepts."
                        },
                        {
                            "header": "Scale",
                            "body": "Contributed to the development of processors and tooling to manage large volumes of data."
                        },
                        {
                            "header": "Data",
                            "body": "Investigated large databases to create reports describing various data points to different teams."
                        }
                    ]
                },
                {
                    "header": {
                        "title": "Element AI",
                        "position": "AI Developer Intern",
                        "date": "May 2018 - August 2018"
                    },
                    "body": [
                        {
                            "header": "Experiments",
                            "body": "Experimented with various Natural Language Processing Models."
                        },
                        {
                            "header": "Deployments",
                            "body": "Brought Machine Learning models from a research phase to a deployed web application."
                        },
                        {
                            "header": "Streamline",
                            "body": "Improved the development process of Machine Learning models through various tooling."
                        }
                    ]
                },
                {
                    "header": {
                        "title": "Ubisoft",
                        "position": "Web Developer Intern",
                        "date": "February 2020 - Present"
                    },
                    "body": [
                        {
                            "header": "Learnings",
                            "body": "Learned about best practices for developing and deploying large-scale web applications (authentication services)."
                        },
                        {
                            "header": "Cloud",
                            "body": "Explored the benefits and disadvantages of using in-house versus cloud-based servers by contributing to a migration to cloud services."
                        },
                        {
                            "header": "Maintenance",
                            "body": "Contributed to the maintance and deployment of web services used by millions worldwide."
                        }
                    ]
                },
                {
                    "header": {
                        "title": "Nuance Communications",
                        "position": "Software Engineering Intern",
                        "date": "January 2017 - April 2017"
                    },
                    "body": [
                        {
                            "header": "Development",
                            "body": "Brought a Natural Language Processing application from its infancy to feature-completeness."
                        },
                        {
                            "header": "Design",
                            "body": "Implemented various voice-based human-computer interaction features, such as pronoun comprehension and conversation topic recommendation based on historic data."
                        },
                        {
                            "header": "Integration",
                            "body": "Leveraged a cloud-based API to build an application for a vehicle-based embedded system."
                        }
                    ]
                }
            ]
        },
        "projects": {
          "header": "Projects",
          "blurb": "Throughout my studies, I've worked on various personal projects with the goal of learning new technologies.",
          "content": [
              {
                  "header": "Rental Platform for the Engineering Undergraduate Society",
                  "body": [
                    "Using Flask (back-end) and React (front-end), I've built a rental system for Engineering students.",
                    "The rental platform uses a MySQL database and has been deployed through AWS. It also has an authentication system using Outlook."
                  ],
                  "link": "https://rental.mcgilleus.ca/",
                  "github_link": "https://github.com/McGillEUS/techcabinet"
              },
              {
                  "header": "Repaird (BDC Hackathon)",
                  "body": [
                      "Built the back-end for an app to manage the health of personal vehicles and ease the process of maintaining them.",
                      "I've also explored the provided MySQL database to guide our team's decision in the direction of the project.",
                      "The project won the first prize."
                  ],
                  "link": "https://devpost.com/software/repaird"
              },
              {
                  "header": "Textify (Polytechnique of Montréal Hackathon)",
                  "body": [
                      "Built a decoder for handwritten characters to help travellers understand characters written in foreign languages.",
                      "This was my first experience with machine learning. I built an image recognition model in Keras trained on the popular MNIST dataset."
                  ],
                  "github_link": "https://github.com/ungurandrei/hackatown2018"
              }
          ] 
        },
        "involvement": {
          "header": "Involvement",
          "blurb": "I have a passion for getting involved in various communities linked to my passions. Below are a few organizations I've contributed to recently.",
          "content": [
              {
                  "header": {
                      "title": "Engineering Undergraduate Society",
                      "position": "I.T. Director",
                      "date": "2018 ~ 2019"
                  },
                  "body": [
                      {
                          "header": "Learnings",
                          "body": "I've improved my knowledge of Linux servers and MySQL databases. I've also developed my leadership skills."
                      },
                      {
                          "header": "Responsibilities",
                          "body": "I was the head of a team of 8 members spread across three groups: curators of our internal Wiki, a manager of public displays and webmasters."
                      },
                      {
                          "header": "Impact",
                          "body": "Beyond maintaining the infrastructure, I've improved it by completing a migration from locally-hosted servers to AWS. I've also introduced new technologies to the stack, namely React and Flask."
                      }
                  ],
                  "link": ""
              },
              {
                  "header": {
                      "title": "Game Dev McGill",
                      "position": "V.P. Finances",
                      "date": "2017 ~ 2018"
                  },
                  "body": [
                      {
                          "header": "Learnings",
                          "body": "Having little finance knowledge prior to this experience, I learned to handle the budget of a club."
                      },
                      {
                          "header": "Responsibilities",
                          "body": "I handled sponsor relations, budgeting and expenses. I also contributed to organizing the 2017 and 2018 versions of the club's Game Jam (~150 participants)."
                      },
                      {
                          "header": "Impact",
                          "body": "Our team grew the club to 80 members through its first year of operation. The budget and planning was sustainable to enable continuous growth for the next years of operation."
                      }
                  ],
                  "link": ""
              },
              {
                  "header": {
                      "title": "St. John Ambulance",
                      "position": "First Responder, Assistant Training Coordinator",
                      "date": "2013 ~ 2016"
                  },
                  "body": [
                      {
                          "header": "Learnings",
                          "body": "As a first responder, I've learned various first-aid techniques. I've also developed skills for managing stressful situations."
                      },
                      {
                          "header": "Responsibilities",
                          "body": "I provided First Aid at numerous events ranging from Bell Center shows to local Hockey tournaments."
                      },
                      {
                          "header": "Impact",
                          "body": "I became assistant training coordinator in 2015 and hosted trainings for a team of ~50 members, in addition to ensuring that they achieved the correct certifications."
                      }
                  ],
                  "link": ""
              }
          ]
        }
    }
}
