{
	"intro":"This page was created by Andrei Ungur, a Software Engineering student of McGill University, using GitHub/HTML5/JQuery/Javascript/CSS . Click on any of the tabs above for more information.",
	"about_1":"I’m a Software Engineering student at McGill University aspiring to work as a software developer. My fields of interest are mainly the tech world, programming, health sciences, travelling and music.",
	"about_2":"I am also a quick learner who greatly values self-learning. This very website, for example, is proof of this statement as I had no knowledge of either GitHub, HTML, CSS, JavaScript or JQuery beforehand. With the help of Google, Code Academy and Stackoverflow, I’ve managed to familiarize myself enough with these tools to create this website.",
	"about_3":"Being from Montréal and having attended only French schools until university, I am also fluent at writing/talking in French as well as my mother tongue, Romanian.",
	"mcgill_edu":"Mcgill University",
	"mcgill_desc":["Software Engineering","cGPA : 3.66/4.0","2015-2019"],
	"breb_edu":"Collège Jean-de-Brébeuf",
	"breb_desc":["Health Sciences","Obtained Diplôme d'Études Collégiales (DEC)","2013-2015"],
	"beaubois_edu":"Collège Beaubois",
	"beaubois_desc":["High School","Obtained Diplôme d'Études Secondaires (DES)","2009-2013"],
	"activities_1":"As a future engineer, I am good at tackling challenges and coming up with solutions quickly and efficiently. This is a skill I am continuing to develop by participating in various activities at school such as...",
	"activities_list":["... a Robo-Electronics club in which I built a robot, programmed in C, capable of balancing itself on a see-saw. My team managed to win first place.","I’ve also participated in a hackathon organized by the school, named CodeJam, in which my team and I attempted to write Machine Learning algorithms in a bioinformatics context. This challenge was especially motivating for me as it united two of my interests: health and computer sciences.","In March 2016, I contributed to the creation of a Strategy Game using C# and Unity3D as part of yet another hackathon: McGame Jam."],
	"activities_code":"The code behind these events is unavailable, but more content can be found under the projects section!",
	"volunteering_1":"From September 2013 to March 2016, I was a member of Saint-John Ambulance, a volunteering organization whose mission is to provide first aid for various events ranging from local hockey tournaments to Bell Center shows.",
	"volunteering_list":["Responsible for giving lectures and organizing instructive meetings for 50+ members, as well as ensuring their formation and recertification.","As a First Responder, I provided first aid at over 20 events ranging from local hockey tournaments to Bell Center shows."],
	"work_0":"From June to September 2016, I was a Customer Service and Sales Representative for Air Canada.",
	"work_0_list":["Controlled the flow of 2000-3000 passengers daily.","Oversaw the swift check-in of 100+ passengers daily.","Handled customer complaints and concerns with accurate and professional explanations."],
	"work_1":"In August 2014, I became a mathematics tutor for Cégep-level students at Collège Jean-de-Brébeuf until may 2015.",
	"work_1_list":["Assisted a total of 4 Cégep level students, one hour per week per student, over two semesters, to master the concepts covered in Calculus I and II.","Improved their grades by 5%+ through effective communication skills and strategic study plans.","Committed to answering their questions in a timely and detailed manner, even outside of the tutoring hours."],
	"work_2":"I’ve also worked as a day camp counsellor for three summers (2012-2014).",
	"work_2_list":["Lead groups of 10 to 50 children of ages 5-12 for three summers (6 months in total).","Structured weekly activities, such as outings, in a team.","Provided a secure and educative environment for the children."],
	"projects_contact":"Above, you may find links containing the following two ways to contact me: ",
	"projects_about":"Below are other projects I have worked on. Clicking on the images will provide you with the source content mentionned on the right.",
	"projects_0":["McGill Engineering Competition ","As the Information Technologies director for the 2016 edition of the McGill Engineering Competition, I handle the 2016 edition of the website."],
	"projects_1":["Puzzle solver ","As part of one of my University courses, I had to code a puzzle solver for peg solitaire. My work implements queues as well as a greedy breadth-first search to return a description of the least amount of steps required to get from any combination of the puzzle to that pictured here."],
	"projects_2":["Music ","In my spare time, I also play guitar and record songs. Only two of my recordings have made it to my soundcloud account for the moment, but there will be more to come!"],
	"about":"About Me",
	"education":"Education",
	"experience":"Experience",
	"projects":"Projects",
	"activities":"Activities",
	"volunteering":"Volunteering",
	"work":"Work"
}