{
	"intro":"Hi! I'm Andrei Ungur, a Software Engineering student from McGill University. I've created this page using GitHub/HTML5/JQuery/Javascript/CSS . Click on any of the tabs above for more information!",
	"about_1":"I’m a Software Engineering student at McGill University aspiring to work as a software developer. My fields of interest are mainly the tech world, programming, health sciences, travelling and music.",
	"about_2":"I am also a quick learner who greatly values self-learning. This very website, for example, is proof of this statement as I had no knowledge of either GitHub, HTML, CSS, JavaScript or JQuery beforehand. With the help of Google, Code Academy and Stackoverflow, I’ve managed to familiarize myself enough with these tools to create this website during my first semester of university.",
	"about_3":"Being from Montréal and having attended only French schools until university, I am also fluent at writing/talking in French as well as my mother tongue, Romanian.",
	"mcgill_edu":"Mcgill University",
	"mcgill_desc":["Software Engineering","cGPA : 3.55/4.0","2015-2019"],
	"breb_edu":"Collège Jean-de-Brébeuf",
	"breb_desc":["Health Sciences","Obtained Diplôme d'Études Collégiales (DEC)","2013-2015"],
	"beaubois_edu":"Collège Beaubois",
	"beaubois_desc":["High School","Obtained Diplôme d'Études Secondaires (DES)","2009-2013"],
	"activities_1":"One of my strengths is tackling challenges and coming up with solutions quickly and efficiently. This is a skill I am continuing to develop by participating in various activities such as...",
	"activities_list":["Google Games, during which my team won third place by solving many brain teasers and short coding challenges in little time. One of the problems I solved was finding the longest chain of characters which respected certain criteria, horizontally/vertically/diagonally in a big grid of characters. The criteria was that their value (Z > X > Y etc) had to go through two changes in variation (either increasing then decreasing, like ABCDCBA, or vice-versa).","a Robo-Electronics club in which I built a robot, programmed in C, capable of balancing itself on a see-saw. My team managed to win first place.","In March 2016, I contributed to the creation of a Strategy Game using C# and Unity3D as part of yet another hackathon: McGame Jam. I've since become the VP Finance of the club organizing that event, and helped organize the 2017 edition which received 150 participants. I've also worked on the design of the event's web page: "],
	"activities_code":"The code behind the first two events is unavailable, but more content can be found under the projects section!",
	"projects_contact":"Above, you may find links containing the following two ways to contact me: ",
	"projects_about":"Below are other projects I have worked on. Clicking on the images will provide you with the source content mentionned on the right.",
	"projects_0":["Media Recommender","Using API.AI, I created a small chat bot in Node.js which recommends music. I want to extend its features to also recommend news articles and other media."],
	"projects_1":["CodeJam 2017","During CodeJam, I worked on the back end (Python with Flask) of an app that analyzes how successful a Basketball play might be by classifying the position of the players using a decision tree and comparing their performance in that position to the league’s average. The project won second place at this hackathon."],
	"projects_2":["Football Analyzer","Using data from NFL.COM, this app compares the performance of two teams to determine which might win in a match-up. The back end is in Python with Flask and the data visualisations are done with Matplotlib."],
	"projects_3":["Websites","I’ve worked on a few web sites namely a platform to rent a chalet, the website for the 2016 edition of the McGill Engineering Competition and the website for the McGame Jam (game dev hackathon)."],
	"projects_4":["DNA Sequencer","To help a friend studying Biochemistry, I made a small app that splits a long string into sets of three characters, with different shifts on the initial string."],
	"projects_5":["Puzzle solver ","As part of one of my University courses, I had to code a puzzle solver for peg solitaire. My work implements queues as well as a greedy breadth-first search to return a description of the least amount of steps required to get from any combination of the puzzle to that pictured here."],
	"projects_6":["Music","In my spare time, I also play guitar and record songs. Only two of my recordings have made it to my soundcloud account for the moment, but there will be more to come!"],
	"involvement_0": ["IT Director - Engineering Undergraduate Society (EUS)", "I am the 2018-2019 IT Director of the EUS. I am the head of a team of 8 members spread across three groups: curators of our internal Wiki, a manager of public displays and webmasters. I manage the infrastructure of various services used by all of McGill's undergraduate students in Engineering, namely Room Booking and Voting platforms, using: Apache, PHP, MySQL."],
	"involvement_1": ["VP Finances - Game Dev McGill", "I was the VP Finance of McGill's first ever Game Development club (2017-2018). Within this first year of operation, the club grew to ~80 members. I handled sponsors and expenses and our budget. I also contributed to organizing the 2017 and 2018 versions of the club's Game Jam (~150 participants)."],
	"involvement_2": ["Web Developer - McGill Engineering Competition", "Helped organize the 2017 edition of the McGill Engineering Competition and designed the 2017 version of the event's website."],
	"involvement_3": ["Participant - Roboelectronics", "In 2015, I participated in a four month long robotics competition. The result was a robot capable of balancing on a see-saw, programmed in C, which won first place in the final competition."],
	"involvement_4": ["Assistant Training Coordinator - Saint John Ambulance", "From 2013 to 2016, I was a First Responder within Saint-John Ambulance. I provided first aid at numerous events ranging from Bell Center shows to local hockey tournaments. I became assistant training co-ordinator in 2015 and hosted trainings for a team of ~50 members, in addition to ensuring they achieved the correct certifications."],
	"experience_desc": ["Below is a graph outlining the various internships I have had throughout my undergraduate studies, starting with my first one. It also shows how they relate to my interests, and to skills I've developed through them. Feel free to click on any of the company logos to view more details."],
	"experience_date": ["January 2017 - May 2017", "April 2017 - August 2017", "May 2018 - August 2018"],
	"experience_title": ["AI Developer Intern", "Web Developer Intern", "Software Engineering Intern"],
	"about":"About Me",
	"education":"Education",
	"experience":"Experience",
	"projects":"Projects",
	"activities":"Activities",
	"volunteering":"Volunteering",
	"involvement": "Involvement",
	"work":"Work"
}
