{
	"intro":"This page was created by Andrei Ungur, a Software Engineering student of McGill University, using GitHub/HTML5/JQuery/Javascript/CSS . Click on any of the tabs above for more information.",
	"about_1":"I’m a Software Engineering student at McGill University aspiring to work as a software developer. My fields of interest are mainly the tech world, programming, health sciences, travelling and music.",
	"about_2":"I am also a quick learner who greatly values self-learning. This very website, for example, is proof of this statement as I had no knowledge of either GitHub, HTML, CSS, JavaScript or JQuery beforehand. With the help of Google, Code Academy and Stackoverflow, I’ve managed to familiarize myself enough with these tools to create this website.",
	"about_3":"Being from Montréal and having attended only French schools until university, I am also fluent at writing/talking in French as well as my mother tongue, Romanian.",
	"mcgill_edu":"Mcgill University",
	"mcgill_desc":["Software Engineering","cGPA : 3.66/4.0","2015-2019"],
	"breb_edu":"Collège Jean-de-Brébeuf",
	"breb_desc":["Health Sciences","Obtained Diplôme d'Études Collégiales (DEC)","2013-2015"],
	"beaubois_edu":"Collège Beaubois",
	"beaubois_desc":["High School","Obtained Diplôme d'Études Secondaires (DES)","2009-2013"],
	"activities_1":"One of my strengths is tackling challenges and coming up with solutions quickly and efficiently. This is a skill I am continuing to develop by participating in various activities such as...",
	"activities_list":["Google Games, during which my team won third place by solving many brain teasers and short coding challenges in little time. One of the problems I solved was finding the longest chain of characters which respected certain criteria, horizontally/vertically/diagonally in a big grid of characters. The criteria was that their value (Z > X > Y etc) had to go through two changes in variation (either increasing then decreasing, like ABCDCBA, or vice-versa).","... a Robo-Electronics club in which I built a robot, programmed in C, capable of balancing itself on a see-saw. My team managed to win first place.","In March 2016, I contributed to the creation of a Strategy Game using C# and Unity3D as part of yet another hackathon: McGame Jam. I've since become the VP Finance of the club organizing that event, and helped organize the 2017 edition which received 150 participants. I've also worked on the design of the event's web page."],
	"activities_code":"The code behind the first two events is unavailable, but more content can be found under the projects section!",
	"volunteering_1":"From September 2013 to March 2016, I was a member of Saint-John Ambulance, a volunteering organization whose mission is to provide first aid for various events ranging from local hockey tournaments to Bell Center shows.",
	"volunteering_list":["Responsible for giving lectures and organizing instructive meetings for 50+ members, as well as ensuring their formation and recertification.","As a First Responder, I provided first aid at over 20 events ranging from local hockey tournaments to Bell Center shows."],
	"work_0":"From May to the end of August 2017, I interned at Ubisoft as an Online Programmer.",
	"work_0_list":["Created an administrative REST API in C# and set-up its infrastructure in AWS (Cloud Formation) in a way that auto-deploys the project to new servers from an S3 bucket.","Contributed to moving a service used by millions of players to the cloud by testing the new database layer (C#) and debugging MySql stored procedures.","Improved back-end services used by millions: bug fixes/refactoring, testing, assist weekly maintenances. (C#, Splunk)"],
	"work_1":"In January 2017, I had my first internship as a Software Engineering Intern at Nuance Communications, until the end of April 2017.",
	"work_1_list":["Brought a Natural Language Processing project from its beginning to feature completeness (Javascript).","Developed human-computer interaction features such as contextual natural language generation by integrating an API to an embedded speech recognition service.","Scraped information from an external API to create a mock REST API (Python/Flask) version of it using data stored in PostgreSql.","Transferred knowledge through presentations and displayed the project with demos."],
	"work_2":"From June to September 2016, I was a Customer Service and Sales Representative for Air Canada.",
	"work_2_list":["Controlled the flow of 2000-3000 passengers daily.","Oversaw the swift check-in of 100+ passengers daily.","Handled customer complaints and concerns with accurate and professional explanations."],
	"projects_contact":"Above, you may find links containing the following two ways to contact me: ",
	"projects_about":"Below are other projects I have worked on. Clicking on the images will provide you with the source content mentionned on the right.",
	"projects_0":["McGill Engineering Competition ","As the Information Technologies director for the 2016 edition of the McGill Engineering Competition, I handle the 2016 edition of the website."],
	"projects_1":["Puzzle solver ","As part of one of my University courses, I had to code a puzzle solver for peg solitaire. My work implements queues as well as a greedy breadth-first search to return a description of the least amount of steps required to get from any combination of the puzzle to that pictured here."],
	"projects_2":["Music ","In my spare time, I also play guitar and record songs. Only two of my recordings have made it to my soundcloud account for the moment, but there will be more to come!"],
	"about":"About Me",
	"education":"Education",
	"experience":"Experience",
	"projects":"Projects",
	"activities":"Activities",
	"volunteering":"Volunteering",
	"work":"Work"
}