{
	"intro":"Bonjour! Je m'appelle Andrei Ungur et je suis un étudiant en Génie Logiciel à l’Université McGill. J'ai créé cette page en utilisant Github/HTML5/JQuery/Javascript/CSS/Bootstrap. Cliquez sur les onglets pour plus d’information!",
	"about_1":"Je suis un étudiant en Génie Logiciel à l’Université McGill voulant poursuivre une carrière en tant que développeur. Mes champs d’intérêt, outre le monde technologique et la programmation, sont les sciences de la santé, les voyages et la musique.",
	"about_2":"Je suis également rapide à apprendre des nouvelles choses et j’accorde beaucoup d’importance à l’auto-apprentissage. Une preuve de cela est ce site, puisque je n’avais aucune connaissance des outils utilisés pour le construire avant d’avoir développé la première version durant ma première session d'université. Avec l’aide de Google, Code Academy et Stackoverflow, j’ai réussi à me familiariser assez avec les outils pour créer la première version de ce site. ",
	"about_3":"Étant Montréalais, je suis également capable d’écrire et parler en Anglais, ainsi qu’en Roumain. ",
	"mcgill_edu":"Université McGill",
	"mcgill_desc":["Génie Logiciel","cGPA : 3.55/4.0","2015-2019"],
	"breb_edu":"Collège Jean-de-Brébeuf",
	"breb_desc":["Sciences de la Santé","Obtenu le Diplôme d'Études Collégiales (DEC)","2013-2015"],
	"beaubois_edu":"Collège Beaubois",
	"beaubois_desc":["Secondaire","Obtenu le Diplôme d'Études Secondaires (DES)","2009-2013"],
	"activities_1":"Une de mes forces est d’affronter les défis et les résoudre de façon rapide et efficace. C’est une compétence que je continue d’améliorer en participant à diverses activitiées, telles que:",
	"activities_list":["Google Games, lors duquel mon équipe a atteint la troisième place. Nous avons dû résoudre plusieurs jeux de réflexion et courtes épreuves de programmation. Un exemple de problème que j’ai résolu fut de trouver la plus longue chaîne de caractères respectant une règle précise, horizontalement/verticalement et en diagonal dans une grande grille de caractères. Cette règle était que la chaîne de caractères doit changer de variation d’ordre des lettres dans l’alphabet deux fois (par exemple, ABCDCBA ou ZXRQSYA).","Une compétition de Robotique dans laquelle j’ai construit un robot, programmé en C, capable de se balancer sur une bascule. Mon équipe a réussie à gagner la premiere place.","En Mars 2016, j’ai contribué à la creation d’un jeu de stratégie en utilisant C# et Unity3D lors d’un autre hackathon: McGame Jam. Depuis, je suis devenu le VP Finances du club qui organise l'évènement et j’ai contribué à organiser la version 2017 de celui-ci, qui a accueilli 150 participants. J’ai également participé à la conception du site web de l’évènement, qui peut être retrouvé ci-dessous :"],
	"activities_code":"Le code sur lequel j’ai travaillé lors des deux premiers évènements n’est pas disponible puisqu’on n’a pas utilisés un outil de Version Control, mais plus de contenu peut être trouvé dans la section ‘’projets’’.",
	"projects_contact":"Au-dessus, vous pouvez retrouver des liens ayant deux moyens de communiquer avec moi. ",
	"projects_about":"Au-dessous se retrouvent d’autres projets sur lesquels j’ai travaillé. En cliquant sur les images, vous allez trouver le code source ou simplement un lien vers le projet mentionné à droite. ",
	"projects_0":["Recommandeur Média","Ce petit chat bot créé en Node.js avec API.AI sert à recommander des artistes musicaux. Je continue à travailler dessus dans mon temps libre pour qu’il puisse également recommander des nouvelles et autres médias."],
	"projects_1":["CodeJam 2017","Au cours de CodeJam, j’ai travaillé sur le back-end (Python avec Flask) d’une application qui évalue la position d’un joueur de Basket-Ball sur le terrain grâce à un arbre de décision pour analyser quelle configuration des joueurs est optimale pour un jeu. Ce projet a gagné la deuxième place au hackathon."],
	"projects_2":["Analyseur Football","Cette application analyse les données de NFL.COM pour comparer deux équipes entre elles. Le back-end de l’application est en Python avec Flask et les visualisations de données sont faites grâce à Matplotlib."],
	"projects_3":["Sites Web","J’ai travaillé sur de quelques sites webs dont une plateforme de location de chalet, le site web de l’édition 2016 de la Compétition de Génie à McGill et le site web de McGame Jam (Hackathon de jeux vidéos)."],
	"projects_4":["DNA Sequencer","Pour aider un ami qui étudie en Biochimie, j'ai construit cette petite application qui sépare une chaine de caractères en séquences de trois caractères à la fois, avec différents décalages."],
	"projects_5":["Résolution de casse-tête automatisée","Pour un de me cours Universitaires, j’ai du coder un solveur pour le jeu ‘peg solitaire’. Mon travail implémente des files d’attente (‘Queue’) ainsi qu’un Breadth-First Search greedy, pour retourner une description des étapes nécessaires pour arriver, à partir de n’importe quelle combinaison et dans le moins de coups possible, à la position dans l’image à droite."],
	"projects_6":["Musique ","Dans mes temps libres, je joue également de la guitare et j’enregistre des chansons. Seulement deux de mes enregistrements peuvent être retrouvés sur mon compte Souncloud, mais d’autres viendront dans le futur! "],
	"involvement_0": ["Directeur TI - Engineering Undergraduate Society (EUS)", "Je suis le directeur TI pour l'année scolaire 2018-2019 du comité de génie à McGill. Je suis à la tête d'une équipe de 8 membres: des curateurs de contenu pour un Wiki interne, une équipe qui gère des affichages publics et des Webmasters. Je gère également l'infrastructure de nombreux services utilisés par les étudiants en génie, notamment une plateforme de vote et une autre de réservation de salles dans les édifices de génie (Apache, PHP, MySQL, AWS)."],
	"involvement_1": ["VP Finances - Game Dev McGill", "J'étais le VP Finances du premier club de dévelopement jeu vidéo à McGill, lors de sa première année d'opération (2017-2018). Durant cette première année, le club a grandi à environ 80 membres. J'étais chargé des commanditaires, dépenses et du budget. J'ai également contribué à l'organisation de deux Game Jams annuels (~150 participants) en 2017 et 2018."],
	"involvement_2": ["Développeur Web - McGill Engineering Competition", "J'ai aidé à organiser l'édition 2017 de la compétition de génie à McGill. De plus, j'ai crée la version 2017 du site web de l'évènement."],
	"involvement_3": ["Participant - Roboelectronics", "Durant ma première session universitaire, en 2015, j'ai participé à une compétition de robotique d'une durée de quatre mois. Le résultat était un robot, programmé en C, capable de se balancer sur une bascule. Notre robot a emporté la première place à cette compétition."],
	"involvement_4": ["Assistant Coordinateur des Formations - Ambulance Saint-Jean", "De 2013 à 2016, j'étais un premier répondant au sein d'Ambulance Saint-Jean. J'ai fourni les premiers soins lors de nombreux évènements, de concerts au Centre Bell à des tournois de Hockey locaux. En 2015, je suis devenu l'assistant coordinateur des formations. J'ai fourni des séances de formation à des groupes d'environ 50 membres en plus de m'assurer que les membres participaient aux formations nécessaires pour être des premiers répondants certifiés."],
	"experience_desc": ["Ci-dessous se trouve un graphique qui souligne les divers stages que j'ai eu durant mes études. Ce graphique montre également les liens que ces stages ont eu avec mes intérêts. Vous pouvez le naviguer en cliquant sur les différents logos de compagnies pour voir plus d'information sur les technologies que j'ai utilisé à chaque stage."],
	"experience_date": ["Janvier 2017 - Mai 2017", "Avril 2017 - Août 2017", "Mai 2018 - Août 2018"],
	"experience_title": ["Dévelopeur AI (Stage)", "Dévelopeur Online (Stage)", "Stagiaire en Génie Logiciel"],
	"about":"À Propos",
	"education":"Éducation",
	"experience":"Expérience",
	"projects":"Projets",
	"activities":"Activités",
	"volunteering":"Bénévolat",
	"involvement": "Engagement",
	"work":"Travail"
}
