{
	"intro":"Cette page a été crée par Andrei Ungur, un étudiant en Génie Logiciel à l’Université McGill, en utilisant Github/HTML5/JQuery/Javascript/CSS/Bootstrap. Cliquez sur les onglets pour plus d’information.",
	"about_1":"Je suis un étudiant en Génie Logiciel à l’Université McGill voulant poursuivre une carrière en tant que développeur. Mes champs d’intérêt, outre le monde technologique et la programmation, sont les sciences de la santé, les voyages et la musique.",
	"about_2":"Je suis également rapide à apprendre des nouvelles choses et j’accorde beaucoup d’importance à l’auto-apprentissage. Une preuve de cela est ce site, puisque je n’avais aucune connaissance des outils utilisés pour le construire avant d’avoir développé la première version durant ma première session d'université. Avec l’aide de Google, Code Academy et Stackoverflow, j’ai réussi à me familiariser assez avec les outils pour créer la première version de ce site. ",
	"about_3":"Étant Montréalais, je suis également capable d’écrire et parler en Anglais, ainsi qu’en Roumain. ",
	"mcgill_edu":"Université McGill",
	"mcgill_desc":["Génie Logiciel","cGPA : 3.55/4.0","2015-2019"],
	"breb_edu":"Collège Jean-de-Brébeuf",
	"breb_desc":["Sciences de la Santé","Obtenu le Diplôme d'Études Collégiales (DEC)","2013-2015"],
	"beaubois_edu":"Collège Beaubois",
	"beaubois_desc":["Secondaire","Obtenu le Diplôme d'Études Secondaires (DES)","2009-2013"],
	"activities_1":"Une de mes forces est d’affronter les défis et les résoudre de façon rapide et efficace. C’est une compétence que je continue d’améliorer en participant à diverses activitiées, telles que:",
	"activities_list":["Google Games, lors duquel mon équipe a atteint la troisième place. Nous avons dû résoudre plusieurs jeux de réflexion et courtes épreuves de programmation. Un exemple de problème que j’ai résolu fut de trouver la plus longue chaîne de caractères respectant une règle précise, horizontalement/verticalement et en diagonal dans une grande grille de caractères. Cette règle était que la chaîne de caractères doit changer de variation d’ordre des lettres dans l’alphabet deux fois (par exemple, ABCDCBA ou ZXRQSYA).","Une compétition de Robotique dans laquelle j’ai construit un robot, programmé en C, capable de se balancer sur une bascule. Mon équipe a réussie à gagner la premiere place.","En Mars 2016, j’ai contribué à la creation d’un jeu de stratégie en utilisant C# et Unity3D lors d’un autre hackathon: McGame Jam. Depuis, je suis devenu le VP Finances du club qui organise l'évènement et j’ai contribué à organiser la version 2017 de celui-ci, qui a accueilli 150 participants. J’ai également participé à la conception du site web de l’évènement, qui peut être retrouvé ci-dessous :"],
	"activities_code":"Le code sur lequel j’ai travaillé lors des deux premiers évènements n’est pas disponible puisqu’on n’a pas utilisés un outil de Version Control, mais plus de contenu peut être trouvé dans la section ‘’projets’’.",
	"volunteering_1":"De Septembre 2013 à Mars 2016, j’étais membre d’Ambulance Saint-Jean, une organization à but non-lucratif don’t la mission est de fournir les premiers soins à plusieurs évènements s’étalant de tournois de Hockey locaux à des spectacles au Centre Bell. ",
	"volunteering_list":["Responsable de données des cours et organiser des meetings instructifs pour 50+ membres, ainsi qu’à m’assurer de leur formation et recertification. ","Ent ant que Premier Répondant, j’ai fourni les premiers soins à plus de 20 évènements. "],
	"work_0":"De Mai à la fin d'août 2017, j'étais stagiaire chez Ubisoft en tant que Programmeur Online.",
	"work_0_list":["Créé un API REST administratif en C# et j’ai préparé son infrastructure en AWS (Cloud Formation) d’une façon qui auto-déploie le projet aux nouveaux serveurs à partir d’un « bucket » S3.","Contribué à déplacer un service utilisé par des millions de joueurs vers le « cloud » en testant le nouveau « Database Layer » (C#) et en débuggant des procédures stockées MySql.","J’ai amélioré des services back-end utilisés par des millions de joueurs à travers des fixes de bugs, refactorisation, tests et en assistant aux maintenances hebdomadaires. (C#, Splunk)"],
	"work_1":"En Janvier 2017, j’ai débuté mon premier stage en tant que Software Engineering Intern chez Nuance Communications. Ce stage a duré jusqu’à la fin d’Avril 2017. ",
	"work_1_list":["J’étais un des principaux développeurs sur un projet de Traitement de Langage Naturel qui est passé de son tout début à l’état d’avoir toutes les fonctionnalités désirées (Javascript). ","Développé des fonctionnalités d’interaction humain-ordinateur, telles que la génération contextuelle de langage naturel, en intégrant un API à un service de reconnaissance vocale intégré.","Obtenu, à travers du « Web Scraping » d’un API externe, l’information nécessaire pour créer un API REST qui moquait l’autre (Python/Flask). Nos données étaient stockées dans une base de données PostgreSql.","Transféré mes connaissances du projet à travers des présentations et exposé le projet à travers des demos."],
	"work_2":"De Juin à Septembre 2016, j’étais un Représentant de Ventes et Service à la Clientèle pour Air Canada. ",
	"work_2_list":["Controllé le passage de 2000-3000 passagers quotidiennement. ","Supervisé l’enregistrement rapide de 100+ passagers à chaque jour. ","Géré les plaintes de clients ainsi que leurs inquiétudes de manière précise et professionnelle. "],
	"projects_contact":"Au-dessus, vous pouvez retrouver des liens ayant deux moyens de communiquer avec moi. ",
	"projects_about":"Au-dessous se retrouvent d’autres projets sur lesquels j’ai travaillé. En cliquant sur les images, vous allez trouver le code source ou simplement un lien vers le projet mentionné à droite. ",
	"projects_0":["Recommandeur Média","Ce petit chat bot créé en Node.js avec API.AI sert à recommander des artistes musicaux. Je continue à travailler dessus dans mon temps libre pour qu’il puisse également recommander des nouvelles et autres médias."],
	"projects_1":["CodeJam 2017","Au cours de CodeJam, j’ai travaillé sur le back-end (Python avec Flask) d’une application qui évalue la position d’un joueur de Basket-Ball sur le terrain grâce à un arbre de décision pour analyser quelle configuration des joueurs est optimale pour un jeu. Ce projet a gagné la deuxième place au hackathon."],
	"projects_2":["Analyseur Football","Cette application analyse les données de NFL.COM pour comparer deux équipes entre elles. Le back-end de l’application est en Python avec Flask et les visualisations de données sont faites grâce à Matplotlib."],
	"projects_3":["Sites Web","J’ai travaillé sur de quelques sites webs dont une plateforme de location de chalet, le site web de l’édition 2016 de la Compétition de Génie à McGill et le site web de McGame Jam (Hackathon de jeux vidéos)."],
	"projects_4":["DNA Sequencer","Pour aider un ami qui étudie en Biochimie, j'ai construit cette petite application qui sépare une chaine de caractères en séquences de trois caractères à la fois, avec différents décalages."],
	"projects_5":["Résolution de casse-tête automatisée","Pour un de me cours Universitaires, j’ai du coder un solveur pour le jeu ‘peg solitaire’. Mon travail implémente des files d’attente (‘Queue’) ainsi qu’un Breadth-First Search greedy, pour retourner une description des étapes nécessaires pour arriver, à partir de n’importe quelle combinaison et dans le moins de coups possible, à la position dans l’image à droite."],
	"projects_6":["Musique ","Dans mes temps libres, je joue également de la guitare et j’enregistre des chansons. Seulement deux de mes enregistrements peuvent être retrouvés sur mon compte Souncloud, mais d’autres viendront dans le futur! "],
	"about":"À Propos",
	"education":"Éducation",
	"experience":"Expérience",
	"projects":"Projets",
	"activities":"Activités",
	"volunteering":"Bénévolat",
	"work":"Travail"
}
